package com.rybak.effective.java.ch8;

/**
 * Соблюдайте осторожность при оптимизации
 *
 * Во имя эффективности (без необходимости ее достижения) делается больше вычислительных ошибок
 * , чем по каким-либо другим причинам, включая непроходимую тупость. (Уильям Вульф)
 *
 * Мы обязаны забывать о мелких усовершенствованиях, скажем , на 97% рабочего времени: опрометчивая оптимизация -
 * корень всех зол. (Дональд Кнут)
 *
 * Что касается оптимизации, то мы следуем двум правилам:
 *  - Не делайте этого
 *  - (только для экспертов) Пока не делайте этого - т.е. пока у вас нет абсолютно четкого
 *  , но неоптимизированного решения.( М.А. Джексон)
 *
 * Старайтесь избегать конструкторных решений , ограничивающие производительность.
 *
 * Изучите влияние на производительность тех проектных решений, которые заложены в ваш API.
 *
 * Локализируйте источники проблем с помощью профилировщика и оптимизируйте соответсвующие части системы.
 */
public class Item55 {
}
